exercises/exercise_07_Extraaufgaben.tex
% Created 2025-12-31 Mi 14:03
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,14pt,ngerman]{scrartcl}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{polyglossia}
\usepackage{polyglossia}
\setmainlanguage[variant=german]{german}
\usepackage{polyglossia}
\setdefaultlanguage{german}
\PolyglossiaSetup{german}{shorthands=on}
\AtBeginDocument{\let\babelprovide\relax}
\AtBeginDocument{\let\shorthandon\relax}
\AtBeginDocument{\let\shorthandoff\relax}
\setmainfont{Gentium Book Basic}
\setsansfont{Latin Modern Sans}
\setmonofont{Latin Modern Mono}
\usepackage{fancyhdr}
\usepackage{graphicx}
\usepackage{amsmath,amssymb}
\usepackage{xcolor}
\usepackage{xurl}
\usepackage{listings}
\usepackage{setspace}
\setstretch{1.3}
\usepackage{circuitikz}
\usepackage{tikz}
\usetikzlibrary{automata, positioning, arrows}
\author{Elias}
\date{\today}
\title{Übungsblatt 7}
\hypersetup{
 pdfauthor={Elias},
 pdftitle={Übungsblatt 7},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={German}}
\begin{document}

\section{\textbf{Übung 7}}
\label{sec:org70138ea}
\subsection{\textbf{Klausurvorbereitung - Teil 2}}
\label{sec:org6bcbe94}

Gewünscht waren folgende Themen:

\begin{itemize}
\item Minimalautomat

\item CYK

\item DPDA

\item berechnende TM

\item Resolution (keine Kontradiktion)

\item Keine Pumping-Lemmas?
\end{itemize}
\subsubsection{\textbf{Aufgabe: DFA minimieren}}
\label{sec:orgd002df0}

Minimieren Sie den folgenden DFA:\\
\begin{tikzpicture}
		\node[state, initial] (s1) {$s_1$};
		\node[state, above right=of s1] (s2) {$s_2$};
		\node[state, accepting, right=2cm of s2] (s3) {$s_3$};
		\node[state, accepting, below right=of s1] (s4) {$s_4$};
		\node[state, right=2cm of s4] (s5) {$s_5$};
		\node[state, above right=of s5] (s6) {$s_6$};
		
		\draw (s1) edge[above left] node{a} (s2)
		(s1) edge[below left] node{b} (s4)
		(s2) edge[above] node{a} (s3)
		(s2) edge[left] node{b} (s4)
		(s3) edge[below right, bend left] node{a} (s4)
		(s3) edge[right] node{b} (s5)
		(s4) edge[above left, bend left] node{a} (s3)
		(s4) edge[below] node{b} (s5)
		(s5) edge[loop right] node{a,b} (s5)
		(s6) edge[above right] node{a} (s3)
		(s6) edge[below right] node{b} (s5);
\end{tikzpicture}
\subsubsection{\textbf{Aufgabe: CYK-Algorithmus}}
\label{sec:org3f293cc}

Gegeben sei die Grammatik \(G=(\{S, A, B, C, D\}, \{a, b, c\}, S, P)\)
mit \\
\[\begin{aligned}
        P:S\rightarrow & AB \mid BC\\
        A\rightarrow & a \mid BB \mid BS\\
        B\rightarrow & b \mid CD \mid DA\\
        C\rightarrow & c \mid AS \mid BD\\
        D\rightarrow & a \mid CB \mid AA    
\end{aligned}\]

Prüfen Sie mit dem CYK-Algorithmus, ob das Wort \(bacaac\) in \(L(G)\) enthalten ist.\\
CYK-Demo: \url{https://www.cip.ifi.lmu.de/\~lindebar/}

\begin{verbatim}
S -> AB | BC
A -> a | BB | BS
B -> b | CD | DA
C -> c | AS | BD
D -> a | CB | AA
\end{verbatim}
\subsubsection{\textbf{Aufgabe: Resolution}}
\label{sec:org4d94baf}

Prüfen Sie mittels Resolution, ob die folgende Formel eine Tautologie
ist:

\[(A\land \neg B \land C) \lor E \lor (\neg A \land D \land \neg E) \lor (B \land C \land \neg D) \lor C \lor \neg B\]
\subsubsection{\textbf{Aufgabe: PDA}}
\label{sec:orgaeac29e}

Die folgende Sprache über dem Alphabet \(\Sigma=\{a, b, c\}\) ist
deterministisch kontextfrei:
\[L = \left\{w_1w_2 \in \Sigma^* \mid w_1 \in \{a\}^* \land w_2 \in \{b, c\}^* \land |w_1|=|w_2|\right\}\]

\begin{enumerate}
\item Konstruieren Sie einen deterministischen Kellerautomaten, der diese
Sprache akzeptiert.

\item Ist die Akzeptanz mittels leerem Keller möglich? Begründen Sie Ihre
Antwort.
\end{enumerate}
\subsubsection{\textbf{Aufgabe: Turingmaschine}}
\label{sec:orgcd66ef9}

Konstruieren Sie eine Turingmaschine, die auf einem Eingabewort aus dem
Alphabet \(\Sigma = \{|, -\}\) eine Subtraktion \(x-y\) durchführt.
Dabei stehen Minuend \(x\) und Subtrahend \(y\) in Bierdeckelnotation
hintereinander auf dem Band, getrennt vom Subtraktionsoperator \(-\).
Nach Abarbeitung des Programms soll nur noch das Ergebnis in
Bierdeckelnotation auf dem Band stehen.

Gehen Sie davon aus, dass das Ergebnis der Operation immer größer Null
ist, d.h. der Minuend \(x\) ist bei jeder Eingabe größer als der
Subtrahend \(y\).

\emph{Beispiel:} Das Eingabewort für die Operation \(4-2\) ist auf dem Band
notiert als: \[\#||||-||\#\] Nach Bearbeitung des Eingabewortes steht
auf dem Band \[\#||\#\] und die Turingmaschine befindet sich in einem
Endzustand.
\subsubsection{\textbf{Aufgabe: Pumping-Lemma für reguläre Sprachen}}
\label{sec:org73c09f3}

Zeigen Sie, dass
\[L=\{a^ib^jv \mid v \in \{a\}^* \land |v| \textrm{ ist ungerade } \land j=2i\}\]
über dem Alphabet \(\Sigma=\{a,b\}\) nicht regulär ist.
\subsubsection{\textbf{Aufgabe: Pumping-Lemma für kontextfreie Sprachen}}
\label{sec:orgb59dbe2}

Zeigen Sie, dass \[L=\{a^ib^jc^k \mid i<j<k\}\] über dem Alphabet
\(\Sigma=\{a,b,c\}\) nicht kontextfrei ist.
\end{document}
